# Data Statistic

In [1]:
import pandas as pd
import os
import numpy as np

## Yearly Dengue Case Statistic

In [3]:
df_case = pd.read_csv(os.path.join('data','Dengue Case','dengue_cases_monthly.csv'))
df_case = df_case.drop("Unnamed: 0", axis=1)
df_case.columns = ['addrcode','Year','Month','NumberCases']
df_case['addrcode'] = df_case['addrcode'].astype(str)
df_case.head(10)

  addrcode  Year  Month  NumberCases
0   103604  2014     10            9
1   101203  2014     10            6
2   101504  2014     10            1
3   100502  2014     10            9
4   103001  2014     10           17
5   102601  2014     10           29
6   103501  2014     10            4
7   104401  2014     10            8
8   104004  2014     10           11
9   101401  2014     10           14

In [165]:
aggregation_function = {'NumberCases': 'sum'}
df_numcase = df_case.groupby([df_case['Year'],df_case['Month'],df_case['addrcode'].str[:2]]).aggregate(aggregation_function).reset_index()
df_numcase.head()

   Year  Month addrcode  NumberCases
0  2014      1       10          405
1  2014      1       80          118
2  2014      1       81           31
3  2014      2       10          313
4  2014      2       80           74

In [148]:
aggregation_function = {'NumberCases': 'sum'}
df_subdist = df_case.groupby([df_case['Year'],df_case['Month'],df_case['addrcode'].str[:2]]).size().reset_index(name='NumSubdist')
df_subdist.head()

   Year  Month addrcode  NumSubdist
0  2014      1       10         111
1  2014      1       80          68
2  2014      1       81          16
3  2014      2       10         110
4  2014      2       80          52

In [155]:
df_countdist =df_case.groupby([df_case['Year'],df_case['Month'],df_case['addrcode'].str[:4]]).size().reset_index(name='NumSubdist')
df_dist = df_countdist.groupby([df_countdist['Year'],df_countdist['Month'],df_countdist['addrcode'].str[:2]]).size().reset_index(name='NumDist')
df_dist.head()

   Year  Month addrcode  NumDist
0  2014      1       10       49
1  2014      1       80       22
2  2014      1       81        7
3  2014      2       10       49
4  2014      2       80       20

In [157]:
df_num = pd.merge(df_dist, df_subdist, on= ['Year','Month','addrcode'])
df_num.head()

   Year  Month addrcode  NumDist  NumSubdist
0  2014      1       10       49         111
1  2014      1       80       22          68
2  2014      1       81        7          16
3  2014      2       10       49         110
4  2014      2       80       20          52

### Result

In [167]:
df_province_case = pd.merge(df_num, df_numcase, on = ['Year','Month','addrcode'])
df_province_case.head()

   Year  Month addrcode  NumDist  NumSubdist  NumberCases
0  2014      1       10       49         111          405
1  2014      1       80       22          68          118
2  2014      1       81        7          16           31
3  2014      2       10       49         110          313
4  2014      2       80       20          52           74

In [170]:
df_province_case.to_csv(os.path.join('data','Data Statistic','dengue_province_stat.csv'), encoding='utf-8')

## Weekly Temperature Data

In [188]:
df_weather = pd.read_csv(os.path.join('data','Weather','Unused','weather_weekly_ID.csv'))
df_weather.columns = ['ID','TAM_NAME','Year','Week','Humidity','Rainfall','Temperature','Windspeed','addrcode']
df_weather.head()

ValueError: Length mismatch: Expected axis has 1 elements, new values have 9 elements

In [25]:
df_weather_week = df_weather.groupby([df_weather['Year'],df_weather['Week'],df_weather['addrcode'].str[:2]]).size().reset_index(name = 'count')
df_weather_week.head()

   Year  Week addrcode  count
0  2015     1       80    161
1  2015     1       na      1
2  2015     2       80    161
3  2015     2       na      1
4  2015     3       80    161

In [28]:
df_weather = df_weather.dropna(how='any', axis=0)
df_weather.head()

,ID,TAM_NAME,Year,Week,Humidity,Rainfall,Temperature,Windspeed,addrcode
0,1,ท้องเนียน,2015,1,83.0,0.0,26.2,13.0,801503.0
1,2,ควนทอง,2015,1,83.0,0.0,26.2,13.0,801502.0
2,3,ขนอม,2015,1,83.0,0.0,26.2,13.0,801501.0
3,4,สิชล,2015,1,83.0,0.0,26.2,13.0,801401.0
4,5,สีขีด,2015,1,83.0,0.0,26.2,13.0,801406.0

In [32]:
df_week = df_weather.groupby([df_weather['Year'],df_weather['Week'],df_weather['addrcode'].str[:2]]).size().reset_index(name = 'count')
df_week.head()

   Year  Week addrcode  count
0  2015     1       80    161
1  2015     2       80    161
2  2015     3       80    161
3  2015     4       80    161
4  2015     5       80    161

In [35]:
df_week_count = df_week.groupby([df_week['Year']]).size().reset_index(name = 'week_count')
df_week_count.head()

   Year  week_count
0  2015          53
1  2016          53
2  2017          53
3  2018          20

## Monthly Rainfall Data 
### From Trop Med

In [40]:
df_rainfall = pd.read_csv(os.path.join('data','Weather','rainfall.csv'))
df_rainfall['addrcode'] = df_rainfall['addrcode'].astype(str)
df_rainfall.head()

  addrcode        date  rainfall_sum  rainfall_avg
0   100101  2014-03-01          7.23          7.23
1   100101  2014-04-01         47.91         47.91
2   100101  2014-05-01        142.65        142.65
3   100101  2014-06-01        123.27        123.27
4   100101  2014-07-01        109.71        109.71

In [49]:
df_rainfall['date'] = pd.to_datetime(df_weather['date'],format = '%Y-%m-%d')
df_rainfall['Year'] = df_weather['date'].dt.year
df_rainfall['Month'] = df_weather['date'].dt.month
df_rainfall = df_rainfall[['addrcode','date','Year','Month','rainfall_sum','rainfall_avg']]
df_rainfall.head()

  addrcode       date  Year  Month  rainfall_sum  rainfall_avg
0   100101 2014-03-01  2014      3          7.23          7.23
1   100101 2014-04-01  2014      4         47.91         47.91
2   100101 2014-05-01  2014      5        142.65        142.65
3   100101 2014-06-01  2014      6        123.27        123.27
4   100101 2014-07-01  2014      7        109.71        109.71

In [60]:
df_rainfallmonth = df_rainfall.groupby([df_rainfall['addrcode'].str[:2],df_rainfall['Year'],df_rainfall['Month']]).size().reset_index(name ='Count')
df_rainfallmonth.head()

  addrcode  Year  Month  Count
0       10  2014      3    154
1       10  2014      4    154
2       10  2014      5    154
3       10  2014      6    154
4       10  2014      7    154

In [65]:
df_rainfallyear = df_rainfallmonth.groupby([df_rainfallmonth['addrcode'].str[:2],df_rainfallmonth['Year']]).size().reset_index(name = 'NumMonth')
df_rainfallyear

   addrcode  Year  NumMonth
0        10  2014        10
1        10  2015        12
2        10  2016        12
3        10  2017        12
4        10  2018         6
5        80  2014        10
6        80  2015        12
7        80  2016        12
8        80  2017        12
9        80  2018         6
10       81  2014        10
11       81  2015        12
12       81  2016        12
13       81  2017        12
14       81  2018         6

In [59]:
df_rainfall.loc[df_rainfall['addrcode'].str[:2] == '10'].head(56)
#df_rainfall.loc[df_rainfall['addrcode'].str[:2] == '80'].head(52)

   addrcode       date  Year  Month  rainfall_sum  rainfall_avg
0    100101 2014-03-01  2014      3          7.23          7.23
1    100101 2014-04-01  2014      4         47.91         47.91
2    100101 2014-05-01  2014      5        142.65        142.65
3    100101 2014-06-01  2014      6        123.27        123.27
4    100101 2014-07-01  2014      7        109.71        109.71
5    100101 2014-08-01  2014      8        200.46        200.46
6    100101 2014-09-01  2014      9        215.00        215.00
7    100101 2014-10-01  2014     10        180.21        180.21
8    100101 2014-11-01  2014     11         55.71         55.71
9    100101 2014-12-01  2014     12         16.48         16.48
10   100101 2015-01-01  2015      1          7.74          7.74
11   100101 2015-02-01  2015      2         35.99         35.99
12   100101 2015-03-01  2015      3        131.60        131.60
13   100101 2015-04-01  2015      4         79.82         79.82
14   100101 2015-05-01  2015      5         46.95         46.95
15   100101 2015-06-01  2015      6        226.90        226.90
16   100101 2015-07-01  2015      7        121.55        121.55
17   100101 2015-08-01  2015      8         94.83         94.83
18   100101 2015-09-01  2015      9        320.44        320.44
19   100101 2015-10-01  2015     10        267.26        267.26
20   100101 2015-11-01  2015     11         32.88         32.88
21   100101 2015-12-01  2015     12         33.81         33.81
22   100101 2016-01-01  2016      1         62.51         62.51
23   100101 2016-02-01  2016      2          0.58          0.58
24   100101 2016-03-01  2016      3         21.08         21.08
25   100101 2016-04-01  2016      4         16.62         16.62
26   100101 2016-05-01  2016      5        104.44        104.44
27   100101 2016-06-01  2016      6        302.44        302.44
28   100101 2016-07-01  2016      7        222.10        222.10
29   100101 2016-08-01  2016      8        189.42        189.42
30   100101 2016-09-01  2016      9        352.77        352.77
31   100101 2016-10-01  2016     10        338.90        338.90
32   100101 2016-11-01  2016     11         81.16         81.16
33   100101 2016-12-01  2016     12          3.33          3.33
34   100101 2017-01-01  2017      1         50.37         50.37
35   100101 2017-02-01  2017      2          0.00          0.00
36   100101 2017-03-01  2017      3         97.72         97.72
37   100101 2017-04-01  2017      4         37.17         37.17
38   100101 2017-05-01  2017      5        399.99        399.99
39   100101 2017-06-01  2017      6        178.78        178.78
40   100101 2017-07-01  2017      7        222.84        222.84
41   100101 2017-08-01  2017      8        265.97        265.97
42   100101 2017-09-01  2017      9        273.15        273.15
43   100101 2017-10-01  2017     10        303.49        303.49
44   100101 2017-11-01  2017     11         48.67         48.67
45   100101 2017-12-01  2017     12         33.07         33.07
46   100101 2018-01-01  2018      1         86.45         86.45
47   100101 2018-02-01  2018      2         72.64         72.64
48   100101 2018-03-01  2018      3         73.93         73.93
49   100101 2018-04-01  2018      4        200.21        200.21
50   100101 2018-05-01  2018      5        145.02        145.02
51   100101 2018-06-01  2018      6         47.91         47.91
52   100102 2014-03-01  2014      3          7.23          7.23
53   100102 2014-04-01  2014      4         47.91         47.91
54   100102 2014-05-01  2014      5        142.65        142.65
55   100102 2014-06-01  2014      6        123.27        123.27

## Monthly Land Scape Temperature Data
### From Trop Med

In [55]:
df_temp = pd.read_csv(os.path.join('data','Weather','temperature.csv'))
df_temp['addrcode'] = df_temp['addrcode'].astype(str)
df_temp.head()

  addrcode        date  temperature
0   100101  2014-01-01        34.39
1   100101  2014-02-01        36.77
2   100101  2014-03-01        39.61
3   100101  2014-04-01        37.45
4   100101  2014-05-01        40.71

In [56]:
df_temp['date'] = pd.to_datetime(df_temp['date'],format = '%Y-%m-%d')
df_temp['Year'] = df_temp['date'].dt.year
df_temp['Month'] = df_temp['date'].dt.month
df_temp = df_temp[['addrcode','date','Year','Month','temperature']]
df_temp.head()

  addrcode       date  Year  Month  temperature
0   100101 2014-01-01  2014      1        34.39
1   100101 2014-02-01  2014      2        36.77
2   100101 2014-03-01  2014      3        39.61
3   100101 2014-04-01  2014      4        37.45
4   100101 2014-05-01  2014      5        40.71

In [64]:
df_tempmonth = df_temp.groupby([df_temp['addrcode'].str[:2],df_temp['Year'],df_temp['Month']]).size().reset_index(name ='Count')
df_tempmonth.head()

  addrcode  Year  Month  Count
0       10  2014      1    154
1       10  2014      2    154
2       10  2014      3    154
3       10  2014      4    154
4       10  2014      5    154

In [66]:
df_tempyear = df_tempmonth.groupby([df_tempmonth['addrcode'].str[:2],df_tempmonth['Year']]).size().reset_index(name = 'NumMonth')
df_tempyear

   addrcode  Year  NumMonth
0        10  2014        12
1        10  2015        12
2        10  2016        12
3        10  2017        12
4        10  2018         5
5        80  2014        12
6        80  2015        12
7        80  2016        12
8        80  2017        12
9        80  2018         5
10       81  2014        12
11       81  2015        12
12       81  2016        12
13       81  2017        12
14       81  2018         5

## Find Missing sub-district from Weather Data

In [73]:
df_allsub = pd.read_csv(os.path.join('data','Data Statistic','province_dist_sub_code.csv'))
df_allsub['Subdistrict_Code'] = df_allsub['Subdistrict_Code'].astype(str)
df_allsub.head()

,Subdistrict_Code,Subdistrict_Name,District_Code,District_Name,Province_Code,Province_Name
0,100101,พระบรมมหาราชวัง,1001,เขตพระนคร,10,กรุงเทพมหานคร
1,100102,วังบูรพาภิรมย์,1001,เขตพระนคร,10,กรุงเทพมหานคร
2,100103,วัดราชบพิธ,1001,เขตพระนคร,10,กรุงเทพมหานคร
3,100104,สำราญราษฎร์,1001,เขตพระนคร,10,กรุงเทพมหานคร
4,100105,ศาลเจ้าพ่อเสือ,1001,เขตพระนคร,10,กรุงเทพมหานคร

In [92]:
df_nakhon = df_allsub.loc[df_allsub['Subdistrict_Code'].str[:2] == '80']
df_nakhon.head()

,Subdistrict_Code,Subdistrict_Name,District_Code,District_Name,Province_Code,Province_Name
6372,800101,ในเมือง,8001,เมืองนครศรีธรรมราช,80,นครศรีธรรมราช
6373,800102,ท่าวัง,8001,เมืองนครศรีธรรมราช,80,นครศรีธรรมราช
6374,800103,คลัง,8001,เมืองนครศรีธรรมราช,80,นครศรีธรรมราช
6375,800106,ท่าไร่,8001,เมืองนครศรีธรรมราช,80,นครศรีธรรมราช
6376,800107,ปากนคร,8001,เมืองนครศรีธรรมราช,80,นครศรีธรรมราช

In [178]:
df_nakhonsubname = df_nakhon['Subdistrict_Code'].reset_index()
df_nakhonsubname = df_nakhonsubname['Subdistrict_Code'].reset_index()
df_nakhonsubname.sort_values('Subdistrict_Code')
df_nakhonsubname

     index Subdistrict_Code
0        0           800101
1        1           800102
2        2           800103
3        3           800106
4        4           800107
5        5           800108
6        6           800112
7        7           800113
8        8           800114
9        9           800115
10      10           800116
11      11           800118
12      12           800119
13      13           800120
14      14           800121
15      15           800122
16      16           800201
17      17           800202
18      18           800203
19      19           800204
20      20           800205
21      21           800301
22      22           800302
23      23           800303
24      24           800304
25      25           800305
26      26           800401
27      27           800403
28      28           800404
29      29           800405
..     ...              ...
140    140           801610
141    141           801611
142    142           801701
143    143           801702
144    144           801703
145    145           801704
146    146           801801
147    147           801802
148    148           801803
149    149           801901
150    150           801902
151    151           801903
152    152           801904
153    153           801905
154    154           801906
155    155           802001
156    156           802002
157    157           802003
158    158           802004
159    159           802101
160    160           802102
161    161           802103
162    162           802104
163    163           802201
164    164           802202
165    165           802203
166    166           802301
167    167           802302
168    168           802303
169    169           802304

[170 rows x 2 columns]

In [183]:
df_weather['Year'] = df_weather['Year'].astype(str)
df_weather['Week'] = df_weather['Week'].astype(str)
df_weather['addrcode'] = df_weather['addrcode'].astype(str)
df_weather.head()

,ID,TAM_NAME,Year,Week,Humidity,Rainfall,Temperature,Windspeed,addrcode
0,1,ท้องเนียน,2015,1,83.0,0.0,26.2,13.0,801503.0
1,2,ควนทอง,2015,1,83.0,0.0,26.2,13.0,801502.0
2,3,ขนอม,2015,1,83.0,0.0,26.2,13.0,801501.0
3,4,สิชล,2015,1,83.0,0.0,26.2,13.0,801401.0
4,5,สีขีด,2015,1,83.0,0.0,26.2,13.0,801406.0

In [119]:
df_weatheryear = df_weather.loc[df_weather['Year'] == '2015']
df_weatherweek = df_weatheryear.loc[df_weatheryear['Week'] == '1']
df_weatherweek.head()

,ID,TAM_NAME,Year,Week,Humidity,Rainfall,Temperature,Windspeed,addrcode
0,1,ท้องเนียน,2015,1,83.0,0.0,26.2,13.0,801503.0
1,2,ควนทอง,2015,1,83.0,0.0,26.2,13.0,801502.0
2,3,ขนอม,2015,1,83.0,0.0,26.2,13.0,801501.0
3,4,สิชล,2015,1,83.0,0.0,26.2,13.0,801401.0
4,5,สีขีด,2015,1,83.0,0.0,26.2,13.0,801406.0

In [179]:
df_weathersubname = df_weatherweek['addrcode'].reset_index()
df_weathersubname = df_weathersubname['addrcode'].reset_index()
df_weathersubname

     index  addrcode
0        0  801503.0
1        1  801502.0
2        2  801501.0
3        3  801401.0
4        4  801406.0
5        5  801402.0
6        6  801408.0
7        7  801403.0
8        8  801404.0
9        9  801407.0
10      10  801405.0
11      11  800802.0
12      12  800811.0
13      13  800806.0
14      14  802101.0
15      15  800803.0
16      16  802104.0
17      17  802103.0
18      18  800809.0
19      19  800801.0
20      20  800804.0
21      21  800813.0
22      22  800807.0
23      23  800204.0
24      24  800120.0
25      25  800810.0
26      26  800203.0
27      27  800202.0
28      28  800201.0
29      29  800205.0
..     ...       ...
132    132  800410.0
133    133  801106.0
134    134  800407.0
135    135  801801.0
136    136  800401.0
137    137  802203.0
138    138  801103.0
139    139  801102.0
140    140  800416.0
141    141  802202.0
142    142  802201.0
143    143  801002.0
144    144  801101.0
145    145  801105.0
146    146  801003.0
147    147  801001.0
148    148  801104.0
149    149  800912.0
150    150  800906.0
151    151  800903.0
152    152  800913.0
153    153  800911.0
154    154  800902.0
155    155  800904.0
156    156  801701.0
157    157  801107.0
158    158  800905.0
159    159  800909.0
160    160  800907.0
161    161  800908.0

[162 rows x 2 columns]

In [169]:
df_missingsubname = pd.merge(df_nakhonsubname, df_weathersubname, how = 'outer')
df_missingsubname

     index Subdistrict_Name   TAM_NAME
0        0          ในเมือง  ท้องเนียน
1        1           ท่าวัง     ควนทอง
2        2             คลัง       ขนอม
3        3           ท่าไร่       สิชล
4        4           ปากนคร      สีขีด
5        5           นาทราย   ทุ่งปรัง
6        6         กำแพงเซา    เขาน้อย
7        7         ไชยมนตรี       ฉลอง
8        8     มะม่วงสองต้น     เสาเภา
9        9          นาเคียน     เทพราช
10      10          ท่างิ้ว    เปลี่ยน
11      11       โพธิ์เสด็จ       กลาย
12      12           บางจาก   ตลิ่งชัน
13      13           ปากพูน    สระแก้ว
14      14           ท่าซัก     นบพิตำ
15      15          ท่าเรือ    ท่าขึ้น
16      16          พรหมโลก     นาเหรง
17      17         บ้านเกาะ      กะหรอ
18      18          อินคีรี    ไทยบุรี
19      19          ทอนหงส์    ท่าศาลา
20      20          นาเรียง   หัวตะพาน
21      21          เขาแก้ว   โพธิ์ทอง
22      22           ลานสกา     โมคลาน
23      23            ท่าดี    ทอนหงส์
24      24            กำโลน     ปากพูน
25      25          ขุนทะเล    ดอนตะโก
26      26             ฉวาง    อินคีรี
27      27            ละอาย   บ้านเกาะ
28      28             นาแว    พรหมโลก
29      29         ไม้เรียง    นาเรียง
..     ...              ...        ...
140    140          รามแก้ว      จันดี
141    141         เกาะเพชร   หลักช้าง
142    142           บางขัน   ช้างกลาง
143    143        บ้านลำนาว     ทุ่งสง
144    144           วังหิน     ท่ายาง
145    145         บ้านนิคม       ปริก
146    146        ถ้ำพรรณรา    แก้วแสน
147    147           คลองเส      นาบอน
148    148            ดุสิต     กุแหระ
149    149       บ้านควนมุด    นาโพธิ์
150    150        บ้านชะอวด  นาหลวงเสน
151    151      ควนหนองคว้า   หนองหงส์
152    152        ทุ่งโพธิ์     เขาขาว
153    153         นาหมอบุญ    ถ้ำใหญ่
154    154          สามตำบล      ชะมาย
155    155            นาพรุ     ควนกรด
156    156            นาสาร     บางขัน
157    157        ท้ายสำเภา   กรุงหยัน
158    158         ช้างซ้าย   นาไม้ไผ่
159    159           นบพิตำ     ที่วัง
160    160          กรุงชิง      เขาโร
161    161            กะหรอ      กะปาง
162    162           นาเหรง        NaN
163    163         ช้างกลาง        NaN
164    164         หลักช้าง        NaN
165    165           สวนขัน        NaN
166    166         เชียรเขา        NaN
167    167           ดอนตรอ        NaN
168    168          สวนหลวง        NaN
169    169           ทางพูน        NaN

[170 rows x 3 columns]